"""
Программа оценивает сложность пароля.

Пользователь вводит пароль, в ответ получает оценку "сложный"/"простой"
Сложным считается пароль, состоящий как минимум из 8-ми символов,
включая цифры и алфавитные символы
"""

import re
if __name__ == '__main__':
    pass
    inpt_pass = input ('Введите пароль: ')
    if len(inpt_pass) >= 8:
        print('Сложный пароль')
    else:
        print('Простой пароль')